[{"name":"AC Up","description":"Your Pokémon\u0027s AC increases by 1. This bonus is included through a Pokémon\u0027s evolutions."},{"name":"Able-Bodied","description":"Your Pokemon\u0027s body is trained to learn from and fight off ailments for long periods of time. After recovering from a status effect, this Pokemon becomes immune to the same status for 3 rounds."},{"name":"Acrobat","description":"Unearthed Arcana: Feats for Skills"},{"name":"Actor","description":"PHB:165"},{"name":"Alert","description":"PHB:165 (Initiative bonus applied to trainer while you are the active Pokémon)"},{"name":"Athlete (DEX)","description":"PHB:165"},{"name":"Athlete (STR)","description":"PHB:165"},{"name":"Brawny","description":"Unearthed Arcana: Feats for Skills"},{"name":"Charger","description":"PHB:165 (When using melee attacks)"},{"name":"Combo Master","description":"Your Pokémon is an expert in combining strikes against a foe. When this feature is selected, combo moves that have the ability to hit more than once are guaranteed to hit at least twice. (Fury Swipes, Double Slap, etc.)"},{"name":"Durable","description":"PHB:166"},{"name":"Elemental Adept","description":"PHB:166 (Choose one of the Pokémon damage types)"},{"name":"Extra Move","description":"Your Pokémon can know five total moves instead of four."},{"name":"Hidden Ability","description":"Your Pokémon reaches inside itself to discover a new ability. It gains access to the Hidden Ability in its stat block."},{"name":"Melee Master","description":"Your Pokemon is a master of close combat. Gain advantage on all attacks of opportunity. Before you make a melee attack, you can choose to take a -5 penalty to the attack roll. If the attack hits, you add \u002B10 to the attack\u0027s damage (Once per move)."},{"name":"Mobile","description":"PHB:168"},{"name":"Observant","description":"PHB:168"},{"name":"Perceptive","description":"Unearthed Arcana:Feats for Skills"},{"name":"Power Sculptor","description":"Your Pokémon is able to sculpt the power of their moves around their allies. For area of effect moves your Pokémon activates, choose 1 \u002B MOVE allies in range to automatically succeed on their saving throw against taking damage or an effect. If the damage is halved for a successful save, they take no damage instead."},{"name":"Quick-Fingered","description":"Unearthed Arcana:Feats for Skills"},{"name":"Ranged Master","description":"Your Pokemon is a sharpshooter. Your ranged attacks ignore half and three-fourths cover, Before you make a ranged attack, you can choose to take a -5 penalty to the attack roll. If the attack hits, you add \u002B10 to the attack\u0027s damage (Once per move)."},{"name":"Resilient (CHA)","description":"PHB:168"},{"name":"Resilient (CON)","description":"PHB:168"},{"name":"Resilient (DEX)","description":"PHB:168"},{"name":"Resilient (INT)","description":"PHB:168"},{"name":"Resilient (STR)","description":"PHB:168"},{"name":"Resilient (WIS)","description":"PHB:168"},{"name":"Savage Attacker","description":"PHB:169"},{"name":"Sentinel","description":"PHB:169"},{"name":"Skilled","description":"PHB:170"},{"name":"Skulker","description":"PHB:170"},{"name":"Stealthy","description":"Unearthed Arcana:Feats for Skills"},{"name":"Terrain Adept","description":"Your Pokémon is especially skilled when fighting on a specific terrain. Choose one of the following terrains when selecting this feature. Your Pokémon gains \u002B2 to attack rolls when in this terrain. Terrains: Coastal, Swamp, Forest, Arctic, Desert, Grassland, Hill, Mountain, Underwater."},{"name":"Tireless","description":"Your Pokémon endures hours of rigorous training which keep it in battle longer than the average Pokémon. Gain \u002B1 PP for every move."},{"name":"Tough","description":"PHB:170"},{"name":"Wrangler","description":"You have developed a unique set of skills that give you the ability to grapple and hold an opponent down with steady and strong hands. You gain the following benefits:\n* You have advantage on attack rolls against a creature you are Grappling.\n* You can use your action to try to pin a creature already Grappled by you. To do so, make another grapple check. If you succeed, you and the creature are both Restrained until the grapple ends.\n* When a creature attempts to use their movement to leave your reach without disengaging, you may use your reaction to attempt to Grapple the target."}]