[{"name":"Ability Capsule","effect":"A consumable item that allows a Pokémon to switch the non-hidden ability it knows (if two options are available)."},{"name":"Air Balloon","effect":"Pokémon that holds this is immune to ground-type moves. Pops when holder is hit by an attack."},{"name":"Arceus Plate","effect":"Changes the typing of Arceus and the move \u0022Judgement\u0022"},{"name":"Aspear Berry","effect":"Cures freeze. Activated when a Pokémon becomes frozen"},{"name":"Assault Vest","effect":"Pokémon that hold this gain \u002B1 to their AC, but can only use damaging moves."},{"name":"Babiri Berry","effect":"Pokémon takes half damage from a steel-type move. Activates when damaged by a steel-type move."},{"name":"Big Root","effect":"HP stealing moves restore an additional 1d12 HP (without additional damage to the target)."},{"name":"Black Belt","effect":"Holder adds prof. bonus to damage from fighting-type moves (once per move)."},{"name":"Black Glasses","effect":"Holder adds prof. bonus to damage from dark-type moves (once per move)."},{"name":"Black Sludge","effect":"Restores hp equal to the holder\u0027s prof. bonus to poison types at the end of each of their turns. Damages non-poison types for the same amount instead of healing."},{"name":"Charcoal","effect":"Holder adds prof. bonus to damage from fire-type moves (once per move)."},{"name":"Charti Berry","effect":"Pokémon takes half damage from a rock-type move. Activates when damaged by a rock-type move."},{"name":"Cheri Berry","effect":"Cures paralysis. Activated when a Pokémon becomes paralyzed"},{"name":"Chesto Berry","effect":"Wakes from sleep. Activated when a Pokémon falls asleep"},{"name":"Chilan Berry","effect":"Pokémon takes half damage from a normal-type move. Activates when damaged by a normal-type move."},{"name":"Chople Berry","effect":"Pokémon takes half damage from a fighting-type move. Activates when damaged by a fighting-type move."},{"name":"Coba  Berry","effect":"Pokémon takes half damage from a flying-type move. Activates when damaged by a flying-type move."},{"name":"Colbur Berry","effect":"Pokémon takes half damage from a dark-type move. Activates when damaged by a dark-type move."},{"name":"DNA Splicer","effect":"Allows Kyerum to fuse into Black or White form."},{"name":"Damp Rock","effect":"Holder increases the duration of their Rain Dance move by 3 rounds."},{"name":"Deep Sea Scale","effect":"While a Clamperl holds this, their AC is increased by 1"},{"name":"Deep Sea Tooth","effect":"While a Clamperl holds this, their STAB increases by 1"},{"name":"Dragon Fang","effect":"Holder adds prof. bonus to damage from dragon-type moves (once per move)."},{"name":"Eject Button","effect":"When hit by an attack, holder may switch out as a free action"},{"name":"Flame Orb","effect":"While held, this orb inflicts the burn status at the end of every turn."},{"name":"Focus Band","effect":"Roll a d20 when suffering from the flinched status. On a 10 or higher, you do not flinch."},{"name":"Genesect Drive","effect":"Casettes that change the typing of Genesect\u0027s move \u0022Techo Blast\u0022"},{"name":"Gracidea Flower","effect":"A beautiful flower that allows Shaymin to change forms."},{"name":"Grepa Berry","effect":"Permanently lowers Pokémon WIS score by 2, but raises Loyalty by 1."},{"name":"Griseous Orb","effect":"Allows Girantina to switch forms. Its Dragon and Ghost moves double STAB bonus."},{"name":"Haban Berry","effect":"Pokémon takes half damage from a dragon-type move. Activates when damaged by a dragon-type move."},{"name":"Hard Stone","effect":"Holder adds prof. bonus to damage from rock-type moves (once per move)."},{"name":"Heat Rock","effect":"Holder increases the duration of their Sunny Day move by 3 rounds."},{"name":"Hondew Berry","effect":"Permanently lowers Pokémon DEX score by 2, but raises Loyalty by 1."},{"name":"Icy Rock","effect":"Holder increases the duration of their Hail move by 3 rounds."},{"name":"Kasib Berry","effect":"Pokémon takes half damage from a ghost-type move. Activates when damaged by a ghost-type move."},{"name":"Kebia Berry","effect":"Pokémon takes half damage from a poison-type move. Activates when damaged by a poison-type move."},{"name":"Kelpsy Berry","effect":"Permanently lowers Pokémon STR score by 2, but raises Loyalty by 1."},{"name":"King\u0027s Rock","effect":"On natural attack rolls of 19 or 20, the target flinches."},{"name":"Leftovers","effect":"Restores HP equal to the holder\u0027s proficiency bonus at the end of each of their turns."},{"name":"Leppa Berry","effect":"Restores 10 PP to a move. Activated when Pokémon runs out of PP for a move."},{"name":"Life Orb","effect":"Holder adds prof. bonus to its damage rolls, but takes the same amount in damage to itself."},{"name":"Light Ball","effect":"Raises Pikachu\u0027s MOVE power modifier by \u002B1"},{"name":"Lucky Egg","effect":"XP from battle for this Pokémon is increased by 20%"},{"name":"Lucky Punch","effect":"Increases Chansey\u0027s critical hit range by 1 (20 to 19\u002B, etc.)."},{"name":"Lum Berry","effect":"Cures any negative status effect. Activated when Pokémon is affected with status."},{"name":"Magnet","effect":"Holder adds prof. bonus to damage from electric-type moves (once per move)."},{"name":"Megalite","effect":"Allows a final-stage Pokémon to \u0022Mega Evolve\u0022"},{"name":"Metal Coat","effect":"Holder adds prof. bonus to damage from steel-type moves (once per move)."},{"name":"Metal Powder","effect":"When held by Ditto, its CON score increases by \u002B3"},{"name":"Miracle Seed","effect":"Holder adds prof. bonus to damage from grass-type moves (once per move)."},{"name":"Mystic Water","effect":"Holder adds prof. bonus to damage from water-type moves (once per move)."},{"name":"N-Lunarizer","effect":"Allows Necrozma to fuse with Lunala to create Dusk Mane Necrozma|N/A|"},{"name":"N-Solarizer","effect":"Allows Necrozma to fuse with Solgaleo to create Dark Wings Necrozma"},{"name":"NeverMelt Ice","effect":"Holder adds prof. bonus to damage from ice-type moves (once per move)."},{"name":"Occa Berry","effect":"Pokémon takes half damage from a fire-type move. Activates when damaged by a fire-type move."},{"name":"Oran Berry","effect":"Restores 2d4\u002B2 HP. Activated when Pokémon drops below 50% HP."},{"name":"Passho Berry","effect":"Pokémon takes half damage from a water-type move. Activates when damaged by a water-type move."},{"name":"Payapa Berry","effect":"Pokémon takes half damage from a psychic-type move. Activates when damaged by a psychic-type move."},{"name":"Pecha Berry","effect":"Cures poison. Activated when a Pokémon becomes poisoned"},{"name":"Persim Berry","effect":"Cures confusion. Activated when Pokémon becomes confused."},{"name":"Poison Barb","effect":"Holder adds prof. bonus to damage from poison-type moves (once per move)."},{"name":"Polkadot Bow","effect":"Holder adds prof. bonus to damage from fairy-type moves (once per move)."},{"name":"Pomeg Berry","effect":"Permanently lowers Pokémon CON score by 2, but raises Loyalty by 1."},{"name":"Qualot Berry","effect":"Permanently lowers Pokémon AC by 2, but raises Loyalty by 1."},{"name":"Quick Claw","effect":"Increase initiative roll by \u002B3 while this Pokémon is active."},{"name":"Rawst Berry","effect":"Cures burn. Activated when a Pokémon becomes burned"},{"name":"Razor Claw","effect":"Increases critical hit range by 1 (20 to 19\u002B, etc.)"},{"name":"Razz Berry","effect":"When held by an active Pokémon, trainer gains \u002B1 to catching attempts."},{"name":"Reveal Glass","effect":"Allows Thundurus, Landorus, and Tornadus to change forms"},{"name":"Rindo Berry","effect":"Pokémon takes half damage from a grass-type move. Activates when damaged by a grass-type move."},{"name":"Roseli Berry","effect":"Pokémon takes half damage from a fairy-type move. Activates when damaged by a fairy-type move."},{"name":"Scope Lens","effect":"Increases critical hit range by 1 (20 to 19\u002B, etc.)"},{"name":"Sharp Beak","effect":"Holder adds prof. bonus to damage from flying-type moves."},{"name":"Shell Bell","effect":"Restores HP = prof. bonus after activating a move that damages at least one creature."},{"name":"Shuca Berry","effect":"Pokémon takes half damage from a ground-type move. Activates when damaged by a ground-type move."},{"name":"Silk Scarf","effect":"Holder adds prof. bonus to damage from normal-type moves (once per move)."},{"name":"Silver Powder","effect":"Holder adds prof. bonus to damage from bug-type moves (once per move)."},{"name":"Sitrus Berry","effect":"Restores 30 HP. Activated when Pokémon drops below 50% HP."},{"name":"Smoke Ball","effect":"Guarantees a success in an attempt to flee from wild Pokémon battles."},{"name":"Smooth Rock","effect":"Holder increases the duration of their Sandstorm move by 3 rounds."},{"name":"Soft Sand","effect":"Holder adds prof. bonus to damage from ground-type moves (once per move)."},{"name":"Soothe Bell","effect":"Resets the Loyalty rating of a Pokémon to \u002B0."},{"name":"Spell Tag","effect":"Holder adds prof. bonus to damage from ghost-type moves (once per move)."},{"name":"Stick","effect":"Increases Farfetch\u0027s critical hit range by 1 (20 to 19\u002B, etc.)."},{"name":"Tanga Berry","effect":"Pokémon takes half damage from a bug-type move. Activates when damaged by a bug-type move."},{"name":"Thick Club","effect":"Doubles the STAB bonus of Cubone or Marowak\u0027s moves."},{"name":"Tomato Berry","effect":"Permanently lowers Pokémon speed by 10, but raises Loyalty by 1."},{"name":"Toxic Orb","effect":"While held, this orb inflicts the poison status at the end of every turn."},{"name":"Twisted Spoon","effect":"Holder adds prof. bonus to damage from psychic-type moves (once per move)."},{"name":"Wacan Berry","effect":"Pokémon takes half damage from an electric-type move. Activates when damaged by a electric-type move."},{"name":"Wide Lens","effect":"Holder gains \u002B1 to all attack rolls."},{"name":"Yache Berry","effect":"Pokémon takes half damage from an ice-type move. Activates when damaged by a ice-type move."}]